ConfigurationFonecmidDiplomTuzeka/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ЗапланированныеОтпуска</registerRecords>
  <attributes>
    <name>ВКМ_Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ConfigurationFonecmidDiplomTuzeka/src/Documents/ВКМ_ГрафикОтпусков/Forms/ВКМ_ФормаАнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(Параметры.АдресХранилища) Тогда
		ТаблицаОтпусков = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища);
	Иначе
		ТаблицаОтпусков = Новый ТаблицаЗначений;
	КонецЕсли;

	СформироватьДиаграмму(ТаблицаОтпусков, Параметры.Год);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьДиаграмму(ТаблицаОтпусков, Год)

	Макет = Документы.ВКМ_ГрафикОтпусков.ПолучитьМакет("ВКМ_ДиаграммаГанта");
	ОбластьДиаграммы = Макет.ПолучитьОбласть("Диаграмма");
	ДиаграммаГанта = ОбластьДиаграммы.Рисунки.ДиаграммаГанта.Объект;
	ДиаграммаГанта.Обновление = Ложь;

	Серия = ДиаграммаГанта.УстановитьСерию(НСтр("ru = 'Отпуска'"));

	НачалоПериода = Дата(Год, 1, 1);
	КонецПериода = КонецГода(НачалоПериода);

	СотрудникиОтпусков = ТаблицаОтпусков.Скопировать();
	СотрудникиОтпусков.Свернуть("ВКМ_Сотрудник");

	Для Каждого СтрокаСотрудника Из СотрудникиОтпусков Цикл

		Точка = ДиаграммаГанта.УстановитьТочку(Строка(СтрокаСотрудника.ВКМ_Сотрудник));
		Точка.Текст = Строка(СтрокаСотрудника.ВКМ_Сотрудник);
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);

		СтрокиОтпусков = ТаблицаОтпусков.НайтиСтроки(Новый Структура("ВКМ_Сотрудник", СтрокаСотрудника.ВКМ_Сотрудник));

		Для Каждого СтрокаОтпуска Из СтрокиОтпусков Цикл

			Интервал = Значение.Добавить();
			Интервал.Начало = СтрокаОтпуска.ВКМ_ДатаНачала;
			Интервал.Конец = СтрокаОтпуска.ВКМ_ДатаОкончания;
			Интервал.Текст = Формат(СтрокаОтпуска.ВКМ_ДатаНачала, "ДФ=дд.ММ.гггг") + " - "
				+ Формат(СтрокаОтпуска.ВКМ_ДатаОкончания, "ДФ=дд.ММ.гггг");

		КонецЦикла;

	КонецЦикла;

	ДиаграммаГанта.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Нет;
	ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Ложь;
	ДиаграммаГанта.УстановитьПолныйИнтервал(НачалоПериода, КонецПериода);

	ДиаграммаГанта.Обновление = Истина;

	ВКМ_ТабличныйДокумент.Очистить();
	ВКМ_ТабличныйДокумент.Вывести(ОбластьДиаграммы);

КонецПроцедуры

#КонецОбласти
